{"/":{"title":"Introduction","data":{"":"","welcome-to-fleek-#Welcome to Fleek ⚡":"Welcome to the documentation for the beta of Fleek.xyz. Whether you are an expert or an absolute beginner, you'll find your answers here. Pick a starting point below, or use the search box to find documents matching your keywords.Fleek is a Web3 infrastructure platform that surfaces protocols like IPFS, Arweave, Filecoin, Akask, POKT, ENS, and more. Use them independently or combine them together to create awesome new experiences.Build on the New Internet, and take the road to Web 3.0.","what-can-you-learn-here#What can you learn here?":"Our documentation provides a high level overview for everyone that is trying to build their product using Web 3.0 infrastructure through Fleek's easy to use services.You will learn about our solutions, what features are available and how to interact with them through our various interfaces. You'll find guides on the most common use cases if you fancy some quick solution to your problem, as well as detailed guides on the services.","we-welcome-your-feedback#We welcome your feedback.":"Fleek is a product built by a talented group of people, but we couldn't keep the bar high without our community, that is always pushing us to be better. So if you find we can improve or have a problem, please bring it up through our Twitter\t or Discord\t and we will gladlly help you through it.","found-a-bug-want-a-feature-or-have-an-idea#Found a bug, want a feature, or have an idea?":"We also have a public repository for everyone to create issues, provide feedback or ask questions.","other-relevant-links#Other relevant links.":"Fleek.xyz Website\nMain Twitter Account\nFleek Network"}},"/getting-started":{"title":"Key Concepts","data":{"":"","key-fleek-concepts-#Key Fleek Concepts ⚡":"For more information on Fleek, refer to our raise and vision announcement blog as well as Fleek's architecture overview.","services#Services":"Fleek has adopted a full microservices architecture, we have broken down into smaller pieces so you can use them independently, combine each other or use our own combinations that will be already optimize for the most requested use cases.All the microservices will be traversed by some services that will be standard for all like authentication, billing and many more that will make interacting with Fleek as simple as possible.Some of the available services at the moment or planned are\nIPFS Pinning\nIPNS\nSites (Soon)\nCustom Domains (Soon)","different-interfaces#Different Interfaces":"To interact with the different services you will be presented with an array of interfaces that accomodate to the need you have for each of your use cases.The interfaces available to you are:\nUI\nCLI\nSDK\nGraphQL API","projects#Projects":"All of the usage in the platform will be bounded to a project, so it is mandatory to have a project selected . Any user can create a project and access can be granted to any user by providing an email address.An account can be the owner of orne or more projects and at the same time it can belong to projects own by other accounts."}},"/getting-started/cli":{"title":"CLI","data":{"":"In this guide you will get all the information on how to set up and start interacting with Fleek's Command Line Interface (CLI)","what-is-a-cli#What is a CLI?":"A CLI is a command-line program that accepts text input to execute operating system functions. With this you can interact directlly with all the services surfaced by Fleek directly from you comand line. Fleek CLI provides a unified command line interface to Fleek Services.","install#Install":"This package requires Node.js 16 at a minimum. To install the CLI run\nnpm install -g @fleekxyz/cli","usage#Usage":"The Fleek CLI command has the following structure:\n$ fleek <service> <command> [options and parameters]\nTo view all available services and commands you can use:\n$ fleek help","authentication#Authentication":"All the services in the Fleek CLI require authentication, to do this you have to run:\n$ fleek login\nThis will trigger the login process, we use Web3Auth to manage authentication. Once the flow is completed you will be greeted like this:\n$ fleek login\n🔗 Opening browser on https://rough-truth-3196.on.fleek.xyz/login.html?verificationSession=...\n🧑‍💻 Please login to continue\n✅ Successfully logged in.\nIf at any point you want to logout yo can do so:\n$ fleek logout\n✅ Successfully logged out.","projects#Projects":"As explained here, to interact with services you need to have a project. This can be created and managed via the CLI too!To create a project you can do it like this:\n$ fleek projects created\n$ ? Enter project name: ›\nWhen entered a correct name, you will be automatically switched to it. Also you can switch through the different projects usign the 'switch' command that will promt a selector:\n$ fleek projects switch\n❯   project-1\nproject-2\nproject-3"}},"/getting-started/sdk":{"title":"SDK","data":{"":"SDK documentation is under construction"}},"/services/pinning":{"title":"IPFS Pinning","data":{"":"","what-is-ipfs#What is IPFS?":"The Interplanetary File System (IPFS) is a distributed file storage protocol that allows computers all over the globe to store and serve files as part of a giant peer-to-peer network.","pinning-a-file#Pinning a File":"","what-is-pinning#What is Pinning?":"Pinning is the mechanism that allows you to tell IPFS to store and keep a given object somewhere — the default being your local node, though in this case you will be pinning the object to the Fleek's IPFS Node.","how-to-pin-a-file#How to pin a file?":"There are many different ways that you could use Fleek interfaces to pin a file on IPFS:\n\nTo pin a file using the CLI you need to be authenticated, with a project selected, and use the add command.\n> fleek ipfs add hello.txt\nIPFS Hash: Qmanou5uhcGhyW7noyB7LNFJBZkKcuUZnmpHeQSaidJ367\nWhen the file has been uploaded, you will get the Content Hash corresponding to the file or directories uploaded. You can user a public IPFS gateway to check the uploaded file,  like this.\n\n\nSDK documentation is under construction\n\n\n\nUI documentation is under construction","how-to-viewresolve-a-file#How to view/resolve a file?":"With the files' IPFS hash at hand (e.g. Qmanou5uhcGhyW7noyB7LNFJBZkKcuUZnmpHeQSaidJ367), you can view or resolve your file by using any public or private IPFS gateway.For example, using IPFS' public gateway by appending the hash in the appropiate section: https://ipfs.io/ipfs/Qmanou5uhcGhyW7noyB7LNFJBZkKcuUZnmpHeQSaidJ367.In the near future, Fleek will add custom domain gateway options for users who want custom gateway endpoints - as well as a default public option."}},"/services/ipns":{"title":"IPNS","data":{"":"","what-is-ipns#What is IPNS?":"The InterPlanetary Name System (IPNS) is a system for creating mutable pointers to CIDs known as names or IPNS names. IPNS names can be thought of as links that can be updated over time, while retaining the verifiability of content addressing. In this case in particular, they are mostly used to represent IPFS files (through their hashes).If you want to know more about IPNS and how it works you can read it here","creating-an-ipns-record#Creating an IPNS record":"Creating an IPNS record refers to the creation of an IPNS record and signing it with a private key. Note: Currently Fleek holds the private key with wich all records ar being sigend, in future iterations there will be an option for the user to manage their own keys.To create your first IPNS record you can do as follows\n\nTo create an IPNS record using the CLI you need to be authenticated, with a project selected and use the create command.\n> fleek ipns create\n> Success! IPNS record created.\n> k51qzi5uqu5didozh8jmvbnowwj2d545yacagcply19yvjz8rhn0i1hrbw2thy\n\nWith the IPNS rescord created you can now update it with a CID and publish it to the the different nodes so it can be resolved.\n\n\nSDK documentation is under construction\n\n\n\nUI documentation is under construction","publishing-a-record#Publishing a record":"Publishing an IPNS record means advertising it so that other nodes can resolve it, thus mapping the record to a CID so that the gateway can resolve to it and direct user to the set content.To publish an IPNS record you can do as follows\n\nTo publish an IPNS record with a CID using the CLI you need to be authenticated, with a project selected and use the publish command.\n> fleek ipns publish k51qzi5uqu5didozh8jmvbnowwj2d545yacagcply19yvjz8rhn0i1hrbw2thy QmRG4xcsmoZuXqKuPz3uVBgvo3GZ6k1kLZWhmvzuKtDr9s\n> Success! IPNS record published.\n\n\n\n\nSDK documentation is under construction\n\n\n\nUI documentation is under construction","resolving-an-ipns-record#Resolving an IPNS record":"Fleek comes with a built in resolver for IPNS that allows you to get the CID based on an IPNS record.You can use the resolver to see if what is mapped to a record (yours or someones elses).\n\nTo resole an IPNS record using the CLI you need to be authenticated, with a project selected and use the resolve command.\n> fleek ipns resolve k51qzi5uqu5didozh8jmvbnowwj2d545yacagcply19yvjz8rhn0i1hrbw2thy\n> Success! /ipfs/QmRG4xcsmoZuXqKuPz3uVBgvo3GZ6k1kLZWhmvzuKtDr9s\n\n\n\n\n\nSDK documentation is under construction\n\n\n\nUI documentation is under construction","listing-records#Listing records":"If at any time you want to check all the IPNS records that were created / published with this project you can do so\n\nTo resole an IPNS record using the CLI you need to be authenticated, with a project selected and use the resolve command.\n> fleek ipns list\n> Success! /ipfs/QmRG4xcsmoZuXqKuPz3uVBgvo3GZ6k1kLZWhmvzuKtDr9s\nid                         name                                                            hash\n-----------------------------------------------------------------------------------------------------------------------------------------\nclcuq190y0000jt08mpjw7pdz  k51qzi5uqu5didozh8jmvbnowwj2d545yacagcply19yvjz8rhn0i1hrbw2thy  QmRG4xcsmoZuXqKuPz3uVBgvo3GZ6k1kLZWhmvzuKtDr9s\n\n\n\n\nSDK documentation is under construction\n\n\n\nUI documentation is under construction"}},"/terms":{"title":"Terms and Conditions","data":{"":"PLEASE NOTE THAT YOUR USE OF AND ACCESS TO OUR SERVICES (DEFINED BELOW) ARE SUBJECT TO THE FOLLOWING TERMS; IF YOU DO NOT AGREE TO ALL OF THE FOLLOWING, YOU MAY NOT USE OR ACCESS THE SERVICES IN ANY MANNER.\nTerms of UseEffective date: 16/01/2023Welcome to Fleek. Please read on to learn the rules and restrictions that govern your use of our website(s), products, services and applications (the “Services”). If you have any questions, comments, or concerns regarding these terms or the Services, please contact us at support@fleek.xyz.These Terms of Use (the “Terms”) are a binding contract between you and Fleek LLC (Fleek,” “we” and “us”). You must agree to and accept all of the Terms, or you don’t have the right to use the Services. Your using the Services in any way means that you agree to all of these Terms, and these Terms will remain in effect while you use the Services. These Terms include the provisions in this document, as well as those in the Privacy Policy and Copyright Dispute Policy (fleek.xyz/#/copyright)NOTICE: Please read these Terms carefully. They cover important information about Services provided to you and any charges, taxes, and fees we bill you. These Terms include information about future changes to these Terms, limitations of liability, a class action waiver, and resolution of disputes by arbitration instead of in court.","will-these-terms-ever-change#Will these Terms ever change?":"We are constantly trying to improve our Services, so these Terms may need to change along with the Services. We reserve the right to change the Terms at any time, but if we do, we will bring it to your attention by placing a notice on the https://fleek.xyz website, by sending you an email, and/or by some other means.If you don’t agree with the new Terms, you are free to reject them; unfortunately, that means you will no longer be able to use the Services. If you use the Services in any way after a change to the Terms is effective, that means you agree to all of the changesExcept for changes by us as described here, no other amendment or modification of these Terms will be effective unless in writing and signed by both you and us.","what-about-my-privacy#What about my privacy?":"Fleek takes the privacy of its users very seriously. For the current Fleek Privacy Policy, please click here.The Children’s Online Privacy Protection Act (“COPPA”) requires that online service providers obtain parental consent before they knowingly collect personally identifiable information online from children who are under 13. We do not knowingly collect or solicit personally identifiable information from children under 16; if you are a child under 16, please do not attempt to register for the Services or send any personal information about yourself to us. If we learn we have collected personal information from a child under 16, we will delete that information as quickly as possible. If you believe that a child under 16 may have provided us personal information, please contact us at support@fleek.xyz.","what-are-the-basics-of-using-fleek#What are the basics of using Fleek?":"You may be required to sign up for an account, and select a password and user name (“Fleek User ID”). You promise to provide us with accurate, complete, and updated registration information about yourself. You may not select as your Fleek User ID a name that you don’t have the right to use, or another person’s name with the intent to impersonate that person. You may not transfer your account to anyone else without our prior written permission. You represent and warrant that you are of legal age to form a binding contract (or if not, you’ve received your parent’s or guardian’s permission to use the Services and gotten your parent or guardian to agree to these Terms on your behalf). If you’re agreeing to these Terms on behalf of an organization or entity, you represent and warrant that you are authorized to agree to these Terms on that organization or entity’s behalf and bind them to these Terms (in which case, the references to “you” and “your” in these Terms, except for in this sentence, refer to that organization or entity). You will only use the Services for your own personal use, and not on behalf of or for the benefit of any third party, and only in a manner that complies with all laws that apply to you. If your use of the Services is prohibited by applicable laws, then you aren’t authorized to use the Services. We can’t and won’t be responsible for your using the Services in a way that breaks the law. You will not share your account or password with anyone, and you must protect the security of your account and your password. You’re responsible for any activity associated with your account.","consent-to-receive-periodic-messages#Consent to receive periodic messages":"As part of the Services, you may receive communications through the Services, including messages that Fleek sends you (for example, via SMS) for two-factor authentication. BY SIGNING UP FOR THE SERVICES, YOU AGREE TO RECEIVE COMMUNICATIONS FROM FLEEK, AND YOU REPRESENT AND WARRANT THAT EACH PERSON YOU REGISTER FOR THE SERVICES OR FOR WHOM YOU PROVIDE A WIRELESS PHONE NUMBER HAS CONSENTED TO RECEIVE COMMUNICATIONS FROM FLEEK. You agree to indemnify and hold Fleek harmless from and against any and all claims, liabilities, damages (actual and consequential), losses and expenses (including attorneys’ fees) arising from or in any way related to your breach of the foregoing.Your use of the Services is subject to the following additional restrictions:You represent, warrant, and agree that you will not contribute any Content or User Submission (each of those terms is defined below) or otherwise use the Services or interact with the Services in a manner that:(a) Infringes or violates the intellectual property rights or any other rights of anyone else (including Fleek);(b) Violates any law or regulation, including, without limitation, any applicable export control laws;(c) Is harmful, fraudulent, deceptive, threatening, harassing, defamatory, obscene, or otherwise objectionable;(d) Jeopardizes the security of your Fleek account or anyone else’s (such as allowing someone else to log in to the Services as you);(e) Attempts, in any manner, to obtain the password, account, or other security information from any other user;(f) Violates the security of any computer network, or cracks any passwords or security encryption codes;(g) Runs Maillist, Listserv, any form of auto-responder or “spam” on the Services, or any processes that run or are activated while you are not logged into the Services, or that otherwise interfere with the proper working of the Services (including by placing an unreasonable load on the Services’ infrastructure);(h) “Crawls,” “scrapes,” or “spiders” any page, data, or portion of or relating to the Services or Content (through use of manual or automated means);(i) Copies or stores any significant portion of the Content;(j) Decompiles, reverse engineers, or otherwise attempts to obtain the source code or underlying ideas or information of or relating to the Services.A violation of any of the foregoing is grounds for termination of your right to use or access the Services.","what-are-my-rights-in-the-services#What are my rights in the Services?":"The materials displayed or performed or available on or through the Services, including, but not limited to, text, graphics, data, articles, photos, images, illustrations, User Submissions, and so forth (all of the foregoing, the “Content”) are protected by copyright and/or other intellectual property laws. You promise to abide by all copyright notices, trademark rules, information, and restrictions contained in any Content you access through the Services, and you won’t use, copy, reproduce, modify, translate, publish, broadcast, transmit, distribute, perform, upload, display, license, sell, commercialize or otherwise exploit for any purpose any Content not owned by you, (i) without the prior consent of the owner of that Content or (ii) in a way that violates someone else’s (including Fleek’s) rights. You understand that Fleek owns the Services. You won’t modify, publish, transmit, participate in the transfer or sale of, reproduce (except as expressly provided in this Section), create derivative works based on, or otherwise exploit any of the Services. The Services may allow you to copy or download certain Content; please remember that just because this functionality exists, doesn’t mean that all the restrictions above don’t apply – they do!","do-i-have-to-grant-any-licenses-to-fleek-or-to-other-users#Do I have to grant any licenses to Fleek or to other users?":"Anything you post, upload, share, store, or otherwise provide through the Services is your “User Submission.” Some User Submissions may be viewable by other users. In order to display your User Submissions on the Services, and to allow other users to enjoy them (where applicable), you grant us certain rights in those User Submissions. Please note that all of the following licenses are subject to our Privacy Policy to the extent they relate to User Submissions that are also your personally-identifiable information.For all User Submissions, you hereby grant Fleek a license to translate, modify (for technical purposes, for example making sure your content is viewable on an iPhone as well as a computer) and reproduce and otherwise act with respect to such User Submissions, in each case to enable us to operate the Services, as described in more detail below. This is a license only – your ownership in User Submissions is not affected.If you store a User Submission in your own personal Fleek account, in a manner that is not viewable by any other user except you (a “Personal User Submission”), you grant Fleek the license above, as well as a license to display, perform, and distribute your Personal User Submission for the sole purpose of making that Personal User Submission accessible to you and providing the Services necessary to do so.If you share a User Submission only in a manner that only certain specified users can view (for example, a private message to one or more other users)(a “Limited Audience User Submission”), then you grant Fleek the licenses above, as well as a license to display, perform, and distribute your Limited Audience User Submission for the sole purpose of making that Limited Audience User Submission accessible to such other specified users, and providing the Services necessary to do so. Also, you grant such other specified users a license to access that Limited Audience User Submission, and to use and exercise all rights in it, as permitted by the functionality of the Services.If you share a User Submission publicly on the Services and/or in a manner that more than just you or certain specified users can view a “Public User Submission”), then you grant Fleek the licenses above, as well as a license to display, perform, and distribute your Public User Submission for the purpose of making that Public User Submission accessible to all Fleek users and providing the Services necessary to do so, as well as all other rights necessary to use and exercise all rights in that Public User Submission in connection with the Services and/or otherwise in connection with Fleek’s business. Also, you grant all other users of the Services a license to access that Public User Submission, and to use and exercise all rights in it, as permitted by the functionality of the Services.You agree that the licenses you grant are royalty-free, perpetual, sublicensable, irrevocable, and worldwide.Finally, you understand and agree that Fleek, in performing the required technical steps to provide the Services to our users (including you), may need to make changes to your User Submissions to conform and adapt those User Submissions to the technical requirements of connection networks, devices, services, or media, and the foregoing licenses include the rights to do so.","what-if-i-see-something-on-the-services-that-infringes-my-copyright#What if I see something on the Services that infringes my copyright?":"You may have heard of the Digital Millennium Copyright Act (the “DMCA”), as it relates to online service providers, like Fleek, being asked to remove material that allegedly violates someone’s copyright. We respect others’ intellectual property rights, and we reserve the right to delete or disable Content alleged to be infringing, and to terminate the accounts of repeat alleged infringers; to review our complete Copyright Dispute Policy and learn how to report potentially infringing content. To learn more about the DMCA, click here http://www.copyright.gov/legislation/dmca.pdf","who-is-responsible-for-what-i-see-and-do-on-the-services#Who is responsible for what I see and do on the Services?":"Any information or content publicly posted or privately transmitted through the Services is the sole responsibility of the person from whom such content originated, and you access all such information and content at your own risk, and we aren’t liable for any errors or omissions in that information or content or for any damages or loss you might suffer in connection with it. We cannot control and have no duty to take any action regarding how you may interpret and use the Content or what actions you may take as a result of having been exposed to the Content, and you hereby release us from all liability for you having acquired or not acquired Content through the Services. We can’t guarantee the identity of any users with whom you interact in using the Services and are not responsible for which users gain access to the Services. You are responsible for all Content you contribute, in any manner, to the Services, and you represent and warrant you have all rights necessary to do so, in the manner in which you contribute it. You will keep all your registration information accurate and current. You are responsible for all your activity in connection with the Services.The Services may contain links or connections to third party websites or services that are not owned or controlled by Fleek. When you access third party websites or use third party services, you accept that there are risks in doing so, and that Fleek is not responsible for such risks. We encourage you to be aware when you leave the Services and to read the terms and conditions and privacy policy of each third party website or service that you visit or utilize.Fleek has no control over, and assumes no responsibility for, the content, accuracy, privacy policies, or practices of or opinions expressed in any third party websites or by any third party that you interact with through the Services. In addition, Fleek will not and cannot monitor, verify, censor or edit the content of any third party site or service. By using the Services, you release and hold us harmless from any and all liability arising from your use of any third party website or service.Your interactions with organizations and/or individuals found on or through the Services, including payment and delivery of goods or services, and any other terms, conditions, warranties or representations associated with such dealings, are solely between you and such organizations and/or individuals. You should make whatever investigation you feel necessary or appropriate before proceeding with any online or offline transaction with any of these third parties. You agree that Fleek shall not be responsible or liable for any loss or damage of any sort incurred as the result of any such dealings.If there is a dispute between participants on this site, or between users and any third party, you agree that Fleek is under no obligation to become involved. In the event that you have a dispute with one or more other users, you release Fleek, its directors, officers, employees, agents, and successors from claims, demands, and damages of every kind or nature, known or unknown, suspected or unsuspected, disclosed or undisclosed, arising out of or in any way related to such disputes and/or our Services. If you are a California resident, you shall and hereby do waive California Civil Code Section 1542, which says: “A general release does not extend to claims which the creditor does not know or suspect to exist in his favor at the time of executing the release, which, if known by him must have materially affected his settlement with the debtor.”","will-fleek-ever-change-the-services#Will Fleek ever change the Services?":"We’re always trying to improve the Services, so they may change over time. We may suspend or discontinue any part of the Services, or we may introduce new features or impose limits on certain features or restrict access to parts or all of the Services. We reserve the right to remove any Content from the Services at any time, for any reason (including, but not limited to, if someone alleges you contributed that Content in violation of these Terms), in our sole discretion, and without notice.","do-the-services-cost-anything#Do the Services cost anything?":"The Services may be free or we may charge a fee for using the Services. If you are using a free version of the Services, we will notify you before any Services you are then using begin carrying a fee, and if you wish to continue using such Services, you must pay all applicable fees for such Services. Note that if you elect to receive text messages through the Services, data and message rates may apply. Any and all such charges, fees or costs are your sole responsibility. You should consult with your wireless carrier to determine what rates, charges, fees or costs may apply to your use of the Services.a. Paid Services. Certain of our Services may be subject to payments now or in the future (the “Paid Services”). Please see our Paid Services page for a description of the current Paid Services. Please note that any payment terms presented to you in the process of using or signing up for a Paid Service are deemed part of these Terms.b. Billing. We use a third-party payment processor (the “Payment Processor”) to bill you through a payment account linked to your account on the Services (your “Billing Account”) for use of the Paid Services. The processing of payments will be subject to the terms, conditions and privacy policies of the Payment Processor in addition to these Terms. We are not responsible for error by the Payment Processor. By choosing to use Paid Services, you agree to pay us, through the Payment Processor, all charges at the prices then in effect for any use of such Paid Services in accordance with the applicable payment terms and you authorize us, through the Payment Processor, to charge your chosen payment provider (your “Payment Method”). You agree to make payment using that selected Payment Method. We reserve the right to correct any errors or mistakes that the Payment Processor makes even if it has already requested or received payment.c. Payment Method. The terms of your payment will be based on your Payment Method and may be determined by agreements between you and the financial institution, credit card issuer or other provider of your chosen Payment Method. If we, through the Payment Processor, do not receive payment from you, you agree to pay all amounts due on your Billing Account upon demand.d. Recurring Billing. Some of the Paid Services may consist of an initial period, for which there is a one-time charge, followed by recurring period charges as agreed to by you. By choosing a recurring payment plan, you acknowledge that such Services have an initial and recurring payment feature and you accept responsibility for all recurring charges prior to cancellation. WE MAY SUBMIT PERIODIC CHARGES (E.G., MONTHLY) WITHOUT FURTHER AUTHORIZATION FROM YOU, UNTIL YOU PROVIDE PRIOR NOTICE (RECEIPT OF WHICH IS CONFIRMED BY US) THAT YOU HAVE TERMINATED THIS AUTHORIZATION OR WISH TO CHANGE YOUR PAYMENT METHOD. SUCH NOTICE WILL NOT AFFECT CHARGES SUBMITTED BEFORE WE REASONABLY COULD ACT. TO TERMINATE YOUR AUTHORIZATION OR CHANGE YOUR PAYMENT METHOD, GO TO ACCOUNT SETTINGS.e. Current Information Required. YOU MUST PROVIDE CURRENT, COMPLETE AND ACCURATE INFORMATION FOR YOUR BILLING ACCOUNT. YOU MUST PROMPTLY UPDATE ALL INFORMATION TO KEEP YOUR BILLING ACCOUNT CURRENT, COMPLETE AND ACCURATE (SUCH AS A CHANGE IN BILLING ADDRESS, CREDIT CARD NUMBER, OR CREDIT CARD EXPIRATION DATE), AND YOU MUST PROMPTLY NOTIFY US OR OUR PAYMENT PROCESSOR IF YOUR PAYMENT METHOD IS CANCELED (E.G., FOR LOSS OR THEFT) OR IF YOU BECOME AWARE OF A POTENTIAL BREACH OF SECURITY, SUCH AS THE UNAUTHORIZED DISCLOSURE OR USE OF YOUR USER NAME OR PASSWORD. CHANGES TO SUCH INFORMATION CAN BE MADE AT ACCOUNT SETTINGS. IF YOU FAIL TO PROVIDE ANY OF THE FOREGOING INFORMATION, YOU AGREE THAT WE MAY CONTINUE CHARGING YOU FOR ANY USE OF PAID SERVICES UNDER YOUR BILLING ACCOUNT UNLESS YOU HAVE TERMINATED YOUR PAID SERVICES AS SET FORTH ABOVE.f. Change in Amount Authorized. If the amount to be charged to your Billing Account varies from the amount you preauthorized (other than due to the imposition or change in the amount of state sales taxes), you have the right to receive, and we shall provide, notice of the amount to be charged and the date of the charge before the scheduled date of the transaction. Any agreement you have with your payment provider will govern your use of your Payment Method. You agree that we may accumulate charges incurred and submit them as one or more aggregate charges during or at the end of each billing cycle.g. Reaffirmation of Authorization. Your non-termination or continued use of a Paid Service reaffirms that we are authorized to charge your Payment Method for that Paid Service. We may submit those charges for payment and you will be responsible for such charges. This does not waive our right to seek payment directly from you. Your charges may be payable in advance, in arrears, per usage, or as otherwise described when you initially selected to use the Paid Service.Free Trials and Other Promotions. Any free trial or other promotion that provides access to a Paid Service must be used within the specified time of the trial. You must stop using a Paid Service before the end of the trial period in order to avoid being charged for that Paid Service. If you cancel prior to the end of the trial period and are inadvertently charged for a Paid Service, please contact us at support@fleek.xyz.","what-if-i-want-to-stop-using-the-services#What if I want to stop using the Services?":"You’re free to do that at any time, by contacting us at support@fleek.xyz; please refer to our Privacy Policy, as well as the licenses above, to understand how we treat information you provide to us after you have stopped using our Services.Fleek is also free to terminate (or suspend access to) your use of the Services or your account, for any reason in our discretion, including your breach of these Terms. Fleek has the sole right to decide whether you are in violation of any of the restrictions set forth in these Terms.Account termination may result in destruction of any Content associated with your account, so keep that in mind before you decide to terminate your account.Provisions that, by their nature, should survive termination of these Terms shall survive termination. By way of example, all of the following will survive termination: any obligation you have to pay us or indemnify us, any limitations on our liability, any terms regarding ownership or intellectual property rights, and terms regarding disputes between us, including without limitation the arbitration agreement.","what-else-do-i-need-to-know#What else do I need to know?":"Warranty Disclaimer. Neither Fleek nor its licensors or suppliers make any representations or warranties concerning any content contained in or accessed through the Services, and we will not be responsible or liable for the accuracy, copyright compliance, legality, or decency of material contained in or accessed through the Services. We (and our licensors and suppliers) make no representations or warranties regarding suggestions or recommendations of services or products offered or purchased through the Services. Products and services purchased or offered (whether or not following such recommendations and suggestions) through the Services are provided “AS IS” and without any warranty of any kind from Fleek or others (unless, with respect to such others only, provided expressly and unambiguously in writing by a designated third party for a specific product). THE SERVICES AND CONTENT ARE PROVIDED BY FLEEK (AND ITS LICENSORS AND SUPPLIERS) ON AN “AS-IS” BASIS, WITHOUT WARRANTIES OR ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING, WITHOUT LIMITATION, IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, NON-INFRINGEMENT, OR THAT USE OF THE SERVICES WILL BE UNINTERRUPTED OR ERROR-FREE. SOME STATES DO NOT ALLOW LIMITATIONS ON HOW LONG AN IMPLIED WARRANTY LASTS, SO THE ABOVE LIMITATIONS MAY NOT APPLY TO YOU.Limitation of Liability. TO THE FULLEST EXTENT ALLOWED BY APPLICABLE LAW, UNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY (INCLUDING, WITHOUT LIMITATION, TORT, CONTRACT, STRICT LIABILITY, OR OTHERWISE) SHALL FLEEK (OR ITS LICENSORS OR SUPPLIERS) BE LIABLE TO YOU OR TO ANY OTHER PERSON FOR (A) ANY INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES OF ANY KIND, INCLUDING DAMAGES FOR LOST PROFITS, LOSS OF GOODWILL, WORK STOPPAGE, ACCURACY OF RESULTS, OR COMPUTER FAILURE OR MALFUNCTION, OR (B) ANY AMOUNT, IN THE AGGREGATE, IN EXCESS OF THE GREATER OF (I) $100 OR (II) THE AMOUNTS PAID BY YOU TO FLEEK IN CONNECTION WITH THE SERVICES IN THE TWELVE (12) MONTH PERIOD PRECEDING THIS APPLICABLE CLAIM, OR (C) ANY MATTER BEYOND OUR REASONABLE CONTROL. SOME STATES DO NOT ALLOW THE EXCLUSION OR LIMITATION OF CERTAIN DAMAGES, SO THE ABOVE LIMITATION AND EXCLUSIONS MAY NOT APPLY TO YOU.Indemnity. To the fullest extent allowed by applicable law, You agree to indemnify and hold Fleek, its affiliates, officers, agents, employees, and partners harmless from and against any and all claims, liabilities, damages (actual and consequential), losses and expenses (including attorneys’ fees) arising from or in any way related to any third party claims relating to (a) your use of the Services (including any actions taken by a third party using your account), and (b) your violation of these Terms.Assignment. You may not assign, delegate or transfer these Terms or your rights or obligations hereunder, or your Services account, in any way (by operation of law or otherwise) without Fleek’s prior written consent. We may transfer, assign, or delegate these Terms and our rights and obligations without consent.Choice of Law. These Terms are governed by and will be construed under the Federal Arbitration Act, applicable federal law, and the laws of the State of New York, without regard to the conflicts of laws provisions thereof.Arbitration Agreement. PLEASE READ THE FOLLOWING ARBITRATION AGREEMENT CAREFULLY BECAUSE IT REQUIRES YOU TO ARBITRATE CERTAIN DISPUTES AND CLAIMS WITH FLEEK AND LIMITS THE MANNER IN WHICH YOU CAN SEEK RELIEF FROM US. Both you and Fleek acknowledge and agree that for the purposes of any dispute arising out of or relating to the subject matter of these Terms, Fleek’s officers, directors, employees and independent contractors (“Personnel”) are third party beneficiaries of these Terms, and that upon your acceptance of these Terms, Personnel will have the right (and will be deemed to have accepted the right) to enforce these Terms against you as the third party beneficiary hereof.(a) Arbitration Rules; Applicability of Arbitration Agreement. Any dispute arising out of or relating to the subject matter of these Terms shall be finally settled by binding arbitration in New York, New York. The arbitration will proceed in the English language, in accordance with the Streamlined Arbitration Rules and Procedures of Judicial Arbitration and Mediation Services, Inc. (“JAMS”) then in effect, by one commercial arbitrator with substantial experience in resolving intellectual property and commercial contract disputes, who shall be selected from the appropriate list of JAMS arbitrators in accordance with such Rules. Judgment upon the award rendered by such arbitrator may be entered in any court of competent jurisdiction. Notwithstanding the foregoing obligation to arbitrate disputes, each party shall have the right to pursue injunctive or other equitable relief at any time, from any court of competent jurisdiction.(b) Costs of Arbitration. The JAMS rules will govern payment of all arbitration fees. Fleek will pay all arbitration fees for claims less than $75,000. Fleek will not seek its attorneys’ fees and costs in arbitration unless the arbitrator determines that your claim is frivolous.(c) Small Claims Court. Furthermore, either you or Fleek may assert claims, if they qualify, in small claims court in New York, New York or any United States county where you live or work.(d) Waiver of Jury Trial. YOU AND FLEEK WAIVE ANY CONSTITUTIONAL AND STATUTORY RIGHTS TO GO TO COURT AND HAVE A TRIAL IN FRONT OF A JUDGE OR JURY. You and Fleek are instead choosing to have claims and disputes resolved by arbitration. Arbitration procedures are typically more limited, more efficient, and less costly than rules applicable in court and are subject to very limited review by a court. In any litigation between you and Fleek over whether to vacate or enforce an arbitration award, YOU AND FLEEK WAIVE ALL RIGHTS TO A JURY TRIAL, and elect instead to have the dispute be resolved by a judge.(e) Waiver of Class or Consolidated Actions. ALL CLAIMS AND DISPUTES WITHIN THE SCOPE OF THIS ARBITRATION AGREEMENT MUST BE ARBITRATED OR LITIGATED ON AN INDIVIDUAL BASIS AND NOT ON A CLASS BASIS. CLAIMS OF MORE THAN ONE CUSTOMER OR USER CANNOT BE ARBITRATED OR LITIGATED JOINTLY OR CONSOLIDATED WITH THOSE OF ANY OTHER CUSTOMER OR USER. If however, this waiver of class or consolidated actions is deemed invalid or unenforceable, neither you nor we are entitled to arbitration; instead all claims and disputes will be resolved in a court as set forth in (g) below.(f) Opt-out. You have the right to opt out of the provisions of this Section by sending written notice of your decision to opt out to the following address: 12-16 Vestry St 4th fl New York, NY 10013 postmarked within 30 days of first accepting these Terms. You must include (1) your name and residence address; (2) the email address and/or telephone number associated with your account; and (3) a clear statement that you want to opt out of these Terms’ arbitration agreement.(g) Exclusive Venue. If you send the opt-out notice in (f), and/or in any circumstances where the foregoing arbitration agreement permits either you or Fleek to litigate any dispute arising out of or relating to the subject matter of these Terms in court, then the foregoing arbitration agreement will not apply to either party and both you and Fleek agree that any judicial proceeding (other than small claims actions) will be brought in the state or federal courts located in, respectively, New York, New York, or the Southern District of New York.Miscellaneous. You will be responsible for paying, withholding, filing, and reporting all taxes, duties, and other governmental assessments associated with your activity in connection with the Services, provided that the Fleek may, in its sole discretion, do any of the foregoing on your behalf or for itself as it sees fit. The failure of either you or us to exercise, in any way, any right herein shall not be deemed a waiver of any further rights hereunder. If any provision of these Terms is found to be unenforceable or invalid, that provision will be limited or eliminated, to the minimum extent necessary, so that these Terms shall otherwise remain in full force and effect and enforceable. You and Fleek agree that these Terms are the complete and exclusive statement of the mutual understanding between you and Fleek, and that these Terms supersede and cancel all previous written and oral agreements, communications and other understandings relating to the subject matter of these Terms,. You hereby acknowledge and agree that you are not an employee, agent, partner, or joint venture of Fleek, and you do not have any authority of any kind to bind Fleek in any respect whatsoever.Except as expressly set forth in the section above regarding the arbitration agreement, you and Fleek agree there are no third party beneficiaries intended under these Terms."}},"/privacy":{"title":"Privacy","data":{"":"We at Fleek LLC (Fleek,” “we” and “us”) know you care about how your personal information is used and shared, and we take your privacy seriously. Please read the following to learn more about our Privacy Policy. By using or accessing the Services in any manner, you acknowledge that you accept the practices and policies outlined in this Privacy Policy, and you hereby consent that we will collect, use, and share your information in the following ways.Remember that your use of Fleek’s Services is at all times subject to the Terms of Use, which incorporates this Privacy Policy. Any terms we use in this Policy without defining them have the definitions given to them in the Terms of Use.","what-does-this-privacy-policy-cover#What does this Privacy Policy cover?":"This Privacy Policy covers our treatment of personally identifiable information (“Personal Information”) that we gather when you are accessing or using our Services, but not to the practices of companies we don’t own or control, or people that we don’t manage. We gather various types of Personal Information from our users, as explained in more detail below, and we use this Personal Information internally in connection with our Services, including to personalize, provide, and improve our services, to allow you to set up a user account and profile, to contact you and allow other users to contact you, to fulfill your requests for certain products and services, and to analyze how you use the Services.As noted in the Terms of Use, we do not knowingly collect or solicit personal information from anyone under the age of 16. If you are under 16, please do not attempt to register for the Services or send any personal information about yourself to us. If we learn that we have collected personal information from a child under age 16, we will delete that information as quickly as possible. If you believe that a child under 16 may have provided us personal information, please contact us at support@fleek.xyz.","will-fleek-ever-change-this-privacy-policy#Will Fleek ever change this Privacy Policy?":"We’re constantly trying to improve our Services, so we may need to change this Privacy Policy from time to time as well, but we will alert you to changes by placing a notice on the Services, by sending you an email, and/or by some other means. Please note that if you’ve opted not to receive legal notice emails from us (or you haven’t provided us with your email address), those legal notices will still govern your use of the Services, and you are still responsible for reading and understanding them. If you use the Services after any changes to the Privacy Policy have been posted, that means you agree to all of the changes.","what-information-does-fleek-collect#What Information does Fleek Collect?":"Information You Provide to Us:– First and last name– Email address– Credit/debit card information necessary to process payment– Third-party account credentials (for example, your log-in credentials for GitHub)Certain information may be required to register with us or to take advantage of some of our features.We may communicate with you if you’ve provided us the means to do so. For example, if you’ve given us your email address, we may send you promotional email offers on behalf of other businesses, or email you about your use of the Services. Also, we may receive a confirmation when you open an email from us. This confirmation helps us make our communications with you more interesting and improve our services. If you do not want to receive communications from us, please indicate your preference by contacting us at support@fleek.xyz or via any email's subscription handling option.","information-collected-automatically#Information Collected Automatically":"Whenever you interact with our Services, we automatically receive and record information on our server logs from your browser or device, which may include your geolocation data, device identification, the type of browser and/or device you’re using to access our Services, and the page or feature you requested. We may use this data to customize content for you that we think you might like, based on your usage patterns. We may also use it to improve the Services – for example, this data can tell us how often users use a particular feature of the Services, and we can use that knowledge to make the Services interesting to as many users as possible.","will-fleek-share-any-of-the-personal-information-it-receives#Will Fleek Share Any of the Personal Information it Receives?":"We may share your Personal Information with third parties as described in this section:Analytics: We may use third party analytics service providers, such as Google Analytics for our business purposes, including but not limited to improving and developing our Services, monitoring and analyzing use of our Services, and increasing the functionality and user-friendliness of our Services. Google Analytics may collect and retain some information about you by planting a persistent cookie or identifier on your web browser or device. You may opt out of Google Analytics by visiting https://tools.google.com/dlpage/gaoptout/. Google’s ability to use and share information collected by Google Analytics about your use of the Services is restricted by the Google Analytics Terms of Service and the Google Privacy Policy. You may find additional information about Google’s ability to use and share information collected by Google Analytics by visiting http://www.google.com/policies/privacy/partners/.Protection of Fleek and Others: We reserve the right to access, read, preserve, and disclose any information that we believe is necessary to comply with applicable law or court order or respond to valid legal process, including from law enforcement or other government agencies; enforce or apply our Terms of Use and other agreements; prevent spam or other unwanted communications and investigate or protect against fraud; protect the rights, property, or safety of Fleek, our employees, our users, or others; or maintain the security of our products and services.","is-personal-information-about-me-secure#Is Personal Information about me secure?":"Your account is protected by a password for your privacy and security. If you access your account via a third party site or service, you may have additional or different sign-on protections via that third party site or service. You must prevent unauthorized access to your account and Personal Information by selecting and protecting your password and/or other sign-on mechanism appropriately and limiting access to your computer or device and browser by signing off after you have finished accessing your account.We endeavor to protect the privacy of your account and other Personal Information we hold in our records, but unfortunately, we cannot guarantee complete security. Unauthorized entry or use, hardware or software failure, and other factors, may compromise the security of user information at any time.","what-personal-information-can-i-access#What Personal Information can I access?":"Through your account settings, you may access, and, in some cases, edit or delete the following information you’ve provided to us:– First and last name– Email address– Credit/debit card informationThe information you can view, update, and delete may change as the Services change. If you have any questions about viewing or updating information we have on file about you, please contact us at support@fleek.xyz.","what-choices-do-i-have#What choices do I have?":"You can always opt not to disclose information to us, but keep in mind some information may be needed to register with us or to take advantage of some of our features.You may be able to add, update, or delete information as explained above. When you update information, however, we may maintain a copy of the unrevised information in our records. You may request deletion of your account by emailing support@fleek.xyz. Some information may remain in our records after your deletion of such information from your account. We may use any aggregated data derived from or incorporating your Personal Information after you update or delete it, but not in a manner that would identify you personally.","eu-residents#EU Residents":"If you are a resident of the European Union (“EU”), United Kingdom, Lichtenstein, Norway, or Iceland, you may have additional rights under the EU General Data Protection Regulation (the “GDPR”) with respect to your Personal Data, as outlined below.For this section, we use the terms “Personal Data” and “processing” as they are defined in the GDPR, but “Personal Data” generally means information that can be used to individually identify a person, and “processing” generally covers actions that can be performed in connection with data such as collection, use, storage and disclosure. Fleek will be the controller of your Personal Data processed in connection with the Services.If there are any conflicts between this section and any other provision of this Privacy Policy, the policy or portion that is more protective of Personal Data shall control to the extent of such conflict. If you have any questions about this section or whether any of the following applies to you, please contact us at support@fleek.xyz.What Personal Data Do We Collect From You? We collect Personal Data about you when you provide such information directly to us, when third parties such as our business partners or service providers provide us with Personal Data about you, or when Personal Data about you is automatically collected in connection with your use of our Services. For more information, please refer to “What Information does Fleek Collect?”How Do We Use Your Personal Data? We process Personal Data to operate, improve, understand and personalize our Services. For example, we use Personal Data to:– Create and manage user profiles– Communicate with you about the Services– Process orders– Contact you about Service announcements, updates or offers– Provide support and assistance for the Services– Personalize website content and communications based on your preferences– Meet contract or legal obligations– Respond to user inquiries– Fulfill user requests– Comply with our legal or contractual obligations– Resolve disputes– Protect against or deter fraudulent, illegal or harmful actions– Enforce our Terms of ServiceWe will only process your Personal Data if we have a lawful basis for doing so. Lawful bases for processing include consent, contractual necessity and our “legitimate interests” or the legitimate interest of others, as further described below.– Contractual Necessity: We process the following categories of Personal Data as a matter of “contractual necessity”, meaning that we need to process the data to perform under our Terms of Use with you, which enables us to provide you with the Services. When we process data due to contractual necessity, failure to provide such Personal Data will result in your inability to use some or all portions of the Services that require such data.\nYour full name\nYour email address\n\n– Legitimate Interest: We process the following categories of Personal Data when we believe it furthers the legitimate interest of us or third parties.\nYour phone number\nYour IP address\n\nExamples of these legitimate interests include:\nOperation and improvement of our business, products and services\nMarketing of our products and services\nProvision of customer support\nProtection from fraud or security threats\nCompliance with legal obligations\n\n– Consent: In some cases, we process Personal Data based on the consent you expressly grant to us at the time we collect such data. When we process Personal Data based on your consent, it will be expressly indicated to you at the point and time of collection.– Other Processing Grounds: From time to time we may also need to process Personal Data to comply with a legal obligation, if it is necessary to protect the vital interests of you or other data subjects, or if it is necessary for a task carried out in the public interest.How and With Whom Do We Share Your Data? We share Personal Data with vendors, third party service providers and agents who work on our behalf and provide us with services related to the purposes described in this Privacy Policy or our Terms of Service. These parties include:– Payment processors– Fraud prevention service providers– Analytics service providers– Hosting service providers– Telecommunications service providersWe also share Personal Data when necessary to complete a transaction initiated or authorized by you or provide you with a product or service you have requested. In addition to those set forth above, these parties also include:– Payment processors– Fraud prevention service providers– Analytics service providers– Hosting service providers– Telecommunications service providersWe also share Personal Data when necessary to complete a transaction initiated or authorized by you or provide you with a product or service you have requested. In addition to those set forth above, these parties also include:– Other users (where you post information publicly or as otherwise necessary to effect a transaction initiated or authorized by you through the Services)– Third party business partners who you access through the Services– Other parties authorized by youWe also share information with third parties when you have given us consent to do so (as indicated at the point such information is collected).We also share Personal Data when we believe it is necessary to:– Comply with applicable law or respond to valid legal process, including from law enforcement or other government agencies– Protect us, our business or our users, for example to enforce our terms of service, prevent spam or other unwanted communications and investigate or protect against fraud– Maintain the security of our products and services","how-long-do-we-retain-your-personal-data#How Long Do We Retain Your Personal Data?":"We retain Personal Data about you for as long as you have an open account with us and for 6 months after you close your account. In some cases we retain Personal Data for longer, if doing so is necessary to comply with our legal obligations, resolve disputes or collect fees owed, or is otherwise permitted or required by applicable law, rule or regulation. Afterwards, we retain some information in a depersonalized or aggregated form but not in a way that would identify you personally.","what-security-measures-do-we-use#What Security Measures Do We Use?":"We seek to protect Personal Data using appropriate technical and organizational measures based on the type of Personal Data and applicable processing activity. For example, at any point a user can delete his account and remove their associated information from our database.Personal Data of Children: As noted in the Terms of Use, we do not knowingly collect or solicit Personal Data from anyone under the age of 16. If you are under 16, please do not attempt to register for the Services or send any Personal Data about yourself to us. If we learn that we have collected Personal Data from a child under age 16, we will delete that information as quickly as possible. If you believe that a child under 16 may have provided us Personal Data, please contact us at support@fleek.xyz.","what-rights-do-you-have-regarding-your-personal-data#What Rights Do You Have Regarding Your Personal Data?":"You have certain rights with respect to your Personal Data, including those set forth below. For more information about these rights, or to submit a request, please email support@fleek.xyz. Please note that in some circumstances, we may not be able to fully comply with your request, such as if it is frivolous or extremely impractical, if it jeopardizes the rights of others, or if it is not required by law, but in those circumstances, we will still respond to notify you of such a decision. In some cases, we may also need to you to provide us with additional information, which may include Personal Data, if necessary to verify your identity and the nature of your request.– Access: You can request more information about the Personal Data we hold about you and request a copy of such Personal Data.– Rectification: If you believe that any Personal Data we are holding about you is incorrect or incomplete, you can request that we correct or supplement such data. You can also correct some of this information directly by updating your user profile.– Erasure: You can request that we erase some or all of your Personal Data from our systems.– Withdrawal of Consent: If we are processing your Personal Data based on your consent (as indicated at the time of collection of such data), you have the right to withdraw your consent at any time. Please note, however, that if you exercise this right, you may have to then provide express consent on a case-by-case basis for the use or disclosure of certain of your Personal Data, if such use or disclosure is necessary to enable you to utilize some or all of our Services.– Portability: You can ask for a copy of your Personal Data in a machine-readable format. You can also request that we transmit the data to another controller where technically feasible.– Objection: You can contact us to let us know that you object to the further use or disclosure of your Personal Data for certain purposes.– Restriction of Processing: You can ask us to restrict further processing of your Personal Data.– Right to File Complaint: You have the right to lodge a complaint about Fleek’s practices with respect to your Personal Data with the supervisory authority of your country or EU Member State.Do we transfer EU Users’ Personal Data Outside the EU?The Services are hosted and operated in the United States (“U.S.”) through Fleek and its service providers, and if you do not reside in the U.S., laws in the U.S. may differ from the laws where you reside. By using the Services, you acknowledge that any Personal Data about you, regardless of whether provided by you or obtained from a third party, is being provided to Fleek in the U.S. and will be hosted on U.S. servers, and you authorize Fleek to transfer, store and process your information to and in the U.S., and possibly other countries. You hereby consent to the transfer of your data to the U.S. as set forth herein.Fleek is committed to the following principles regarding the collection and use of Personal Information transferred from the EU: (1) notice, (2) consent, (3) accountability for onward transfer, (4) security, (5) data integrity and purpose limitation, (6) access and (7) recourse, enforcement and liability with respect to all Personal Information received from within the EU the “Principles”. The Principles require that we remain potentially liable if any third party processing Personal Information on our behalf fails to comply with these Principles (except to the extent we are not responsible for the event giving rise to any alleged damage).Please contact us at support@fleek.xyz with any questions or concerns relating to [our privacy practices].","what-if-i-have-questions-about-this-privacy-policy#What if I have questions about this Privacy Policy?":"If you have any questions or concerns regarding our Privacy Policy, please send us a detailed message to support@fleek.xyz, and we will try to resolve your concerns."}},"/quick-start/pinning":{"title":"Pin your NFT collection","data":{"":"let a = 1;\n\nconsole.log(a);","component#Component":"","external-component#External Component":""}},"/quick-start/ipns":{"title":"Create an IPNS record","data":{"":""}},"/services/domains":{"title":"Custom Domains (Soon)","data":{"":"Custom Domains documentation is under construction\nThe Custom Domains services in Fleek will allow users to map domains from multiple providers (DNS, ENS, etc.) to their sites, storage, and Web3 projects/services."}},"/services/sites":{"title":"Sites (Soon)","data":{"":"Sites documentation is under construction\nThe Sites services in Fleek will allow users to upload and easily maintain static sites, stored and served by Web3 protocols."}}}